Repository: mrPoky/HumbleStudio
Catalog: AppleApps/Shared/Resources/Localizable.xcstrings
Source language: en
Languages: cs

# studio.navigation.select_route_node
source: Select a route node
cs: Vyber route uzel

# studio.navigation.select_route_node_description
source: Choose a view in the navigation map to inspect how users reach it and where they can go next.
cs: Vyber view v navigační mapě a zkontroluj, jak se do ní uživatel dostane a kam může pokračovat.

# studio.navigation.path_from_root
source: Path from root
cs: Cesta od rootu

# studio.navigation.how_users_get_here
source: How Users Get Here
cs: Jak se sem uživatelé dostanou

# studio.navigation.what_users_can_do_next
source: What Users Can Do Next
cs: Co mohou uživatelé udělat dál

# studio.navigation.interaction_model
source: Interaction Model
cs: Interakční model

# studio.navigation.root_screen
source: Root screen
cs: Kořenová obrazovka

# studio.snapshot.none
source: No snapshot
cs: Bez snapshotu

# studio.snapshot.catalog_only
source: Catalog only
cs: Jen katalog

# studio.snapshot.reference
source: Reference snapshot
cs: Referenční snapshot

# studio.status.loading_bundled
source: Loading bundled studio…
cs: Načítám přibalené studio…

# studio.status.reloading
source: Reloading studio…
cs: Obnovuji studio…

# studio.status.loading_remote
source: Loading remote source…
cs: Načítám vzdálený zdroj…

# studio.error.native_preview_unavailable
source: Native preview unavailable
cs: Nativní preview není k dispozici

# studio.load_design_export.title
source: Load a design export
cs: Načtěte design export

# studio.load_design_export.workspace_description
source: Open a `.humblebundle`, `.zip`, or `design.json` to populate the native foundations workspace.
cs: Otevřete `.humblebundle`, `.zip` nebo `design.json` a naplňte tím nativní foundations workspace.

# studio.load_design_export.page_description
source: Open a `.humblebundle`, `.zip`, or `design.json` to populate this native page.
cs: Otevřete `.humblebundle`, `.zip` nebo `design.json` a naplňte tím tuto nativní stránku.

# studio.inspector.preview
source: Preview
cs: Náhled

# studio.inspector.relationships
source: Relationships
cs: Vazby

# studio.inspector.source
source: Source
cs: Zdroj

# studio.inspector.section
source: Inspector section
cs: Sekce inspectoru

# studio.foundation.color_detail
source: Color Detail
cs: Detail barvy

# studio.foundation.gradient_detail
source: Gradient Detail
cs: Detail gradientu

# studio.foundation.icon_detail
source: Icon Detail
cs: Detail ikony

# studio.foundation.typography_detail
source: Typography Detail
cs: Detail typografie

# studio.foundation.spacing_detail
source: Spacing Detail
cs: Detail rozestupu

# studio.foundation.corner_radius_detail
source: Corner Radius Detail
cs: Detail zaoblení rohů

# studio.foundation.group
source: Group
cs: Skupina

# studio.foundation.references
source: References
cs: Reference

# studio.foundation.variants
source: Variants
cs: Varianty

# studio.foundation.derived_gradients
source: Derived gradients
cs: Odvozené gradienty

# studio.inspector.what_this_is
source: What This Is
cs: Co to je

# studio.inspector.used_by_components
source: Used By Components
cs: Použito v komponentách

# studio.inspector.used_by_views
source: Used By Views
cs: Použito ve views

# studio.action.inspect_component
source: Inspect Component
cs: Prohlédnout komponentu

# studio.action.inspect_view
source: Inspect View
cs: Prohlédnout view

# studio.foundation.select_token
source: Select a token
cs: Vyberte token

# studio.foundation.select_token_description
source: Choose a color or gradient card to inspect its variants, references, and relationships.
cs: Vyberte kartu barvy nebo gradientu a prohlédněte si její varianty, reference a vazby.

# studio.foundation.type
source: Type
cs: Typ

# studio.foundation.token_colors
source: Token colors
cs: Barvy tokenu

# studio.foundation.truth
source: Truth
cs: Pravda

# studio.foundation.bundled_asset
source: Bundled asset
cs: Přibalený asset

# studio.foundation.used_by
source: Used by
cs: Použito v

# studio.inspector.contract
source: Contract
cs: Kontrakt

# studio.foundation.path
source: Path
cs: Cesta

# studio.foundation.identifier
source: Identifier
cs: Identifikátor

# studio.foundation.select_icon
source: Select an icon
cs: Vyberte ikonu

# studio.foundation.select_icon_description
source: Choose an icon card to inspect its symbol, bundled asset path, and exported usage metadata.
cs: Vyberte kartu ikony a prohlédněte si její symbol, cestu k assetu a exportovaná metadata použití.

# studio.foundation.size
source: Size
cs: Velikost

# studio.foundation.weight
source: Weight
cs: Řez

# studio.inspector.preview_surface
source: Preview Surface
cs: Preview plocha

# studio.inspector.context_preview
source: Context Preview
cs: Kontextové preview

# studio.inspector.flow_context
source: Flow context
cs: Kontext flow

# studio.inspector.usage_signal
source: Usage signal
cs: Signál použití

# studio.inspector.mostly_component_scoped
source: Mostly component-scoped
cs: Převážně na úrovni komponent

# studio.inspector.visible_in_view_flows
source: Visible in view-level flows
cs: Viditelné ve flow na úrovni views

# studio.foundation.select_typography_role
source: Select a typography role
cs: Vyberte typografickou roli

# studio.foundation.select_typography_role_description
source: Choose a type card to inspect its preview copy, scale, and SwiftUI mapping.
cs: Vyberte kartu textového stylu a prohlédněte si její preview text, škálu a SwiftUI mapování.

# studio.foundation.value
source: Value
cs: Hodnota

# studio.foundation.usage
source: Usage
cs: Použití

# studio.foundation.no_usage_guidance
source: No exported usage guidance yet
cs: Zatím bez exportovaného vodítka použití

# studio.foundation.select_spatial_token
source: Select a spatial token
cs: Vyberte prostorový token

# studio.foundation.select_spatial_token_description
source: Choose a spacing or radius token to inspect its value, preview scale, and usage guidance.
cs: Vyberte token rozestupu nebo zaoblení a prohlédněte si jeho hodnotu, škálu preview a vodítka použití.

# studio.foundation.shared_light_dark
source: Shared light/dark
cs: Sdílené light/dark

# studio.foundation.distinct_variants
source: Distinct variants
cs: Oddělené varianty

# studio.foundation.shared_light_dark_value
source: Shared light/dark value
cs: Sdílená light/dark hodnota

# studio.foundation.distinct_light_dark_values
source: Distinct light and dark values
cs: Oddělené light a dark hodnoty

# studio.foundation.typography_preview_sample
source: The quick brown fox jumps over the lazy dog.
cs: Příliš žluťoučký kůň úpěl ďábelské ódy.

# studio.snapshot.catalog
source: Catalog
cs: Katalog

# studio.content.default_state
source: Default state
cs: Výchozí stav

# studio.content.used_in
source: Used in
cs: Použito v

# studio.content.where_it_appears
source: Where It Appears
cs: Kde se objevuje

# studio.content.used_in_views
source: Used In Views
cs: Použito ve views

# studio.content.foundation_categories
source: Foundation categories
cs: Foundation kategorie

# studio.content.state_catalog
source: State Catalog
cs: Katalog stavů

# studio.content.states
source: States
cs: Stavy

# studio.content.design_tokens
source: Design tokens
cs: Design tokeny

# studio.content.source_tokens
source: Source tokens
cs: Source tokeny

# studio.content.file
source: File
cs: Soubor

# studio.content.categories
source: Categories
cs: Kategorie

# studio.content.entry_points
source: Entry points
cs: Vstupní body

# studio.content.primary_actions
source: Primary actions
cs: Primární akce

# studio.content.secondary_actions
source: Secondary actions
cs: Sekundární akce

# studio.content.linked_components
source: Linked components
cs: Navázané komponenty

# studio.content.next_steps
source: Next steps
cs: Další kroky

# studio.content.actions
source: Actions
cs: Akce

# studio.content.edges_label
source: Edges
cs: Hrany

# studio.navigation.depth
source: Depth
cs: Hloubka

# studio.navigation.incoming
source: Incoming
cs: Příchozí

# studio.navigation.outgoing
source: Outgoing
cs: Odchozí

# studio.review.truth_status
source: Truth status
cs: Stav pravdy

# studio.review.gap
source: Gap
cs: Mezera

# studio.navigation.label
source: Navigation
cs: Navigace

# common.missing
source: Missing
cs: Chybí

# common.present
source: Present
cs: Přítomné

# studio.content.not_exported_yet
source: Not exported yet
cs: Zatím neexportováno

# studio.change_proposal.add_precise_target
source: Add precise target after inspection.
cs: Po inspekci doplňte přesný cíl.

# studio.navigation.other
source: Other
cs: Ostatní

# studio.navigation.transition_via
source: %1$@ via %2$@
cs: %1$@ přes %2$@

# studio.content.overlays
source: Overlays
cs: Overlaye

# studio.content.sheets
source: Sheets
cs: Sheety

# studio.content.component_fallback_subtitle
source: Component
cs: Komponenta

# studio.change_proposal.intent_component
source: Tighten native truth for %@ and resolve the current review gap before future write-back.
cs: Zpřesněte nativní pravdu pro %@ a uzavřete aktuální review gap před jakýmkoli budoucím write-backem.

# studio.change_proposal.intent_view
source: Clarify flow, visual truth, or behavior coverage for %@ before any authoring step.
cs: Vyjasněte flow, vizuální pravdu nebo behavior coverage pro %@ před jakýmkoli authoring krokem.

# studio.change_proposal.acceptance_component
source: Keep coverage at %@ or better and preserve current state catalog semantics.
cs: Udržte coverage na %@ nebo lepší a zachovejte současnou sémantiku state katalogu.

# studio.change_proposal.acceptance_view
source: Preserve %@ behavior and re-check current navigation depth and coverage after the proposal is applied.
cs: Zachovejte chování %@ a po aplikaci návrhu znovu zkontrolujte aktuální navigation depth a coverage.

# studio.change_proposal.markdown_title
source: Change Proposal
cs: Návrh změny

# studio.change_proposal.markdown_requested_heading
source: Requested Change
cs: Požadovaná změna

# studio.change_proposal.markdown_structured_targets_heading
source: Structured Targets
cs: Strukturované cíle

# studio.change_proposal.markdown_acceptance_heading
source: Acceptance Notes
cs: Akceptační poznámky

# studio.change_proposal.markdown_recheck_note
source: Re-check the matching native inspector and current preview contract after the change lands.
cs: Po dopadu změny znovu zkontrolujte odpovídající nativní inspector a aktuální preview contract.

# studio.change_proposal.exported_file
source: Proposal exported: %@
cs: Návrh exportován: %@

# studio.change_proposal.repo_saved_file
source: Proposal saved in repo: %@
cs: Návrh uložen v repu: %@

# studio.change_proposal.repo_failed_reason
source: Unable to save proposal in repo: %@
cs: Návrh se nepodařilo uložit do repa: %@

# studio.navigation.graph_nodes_caption
source: Nodes currently in the exported flow graph
cs: Uzly aktuálně v exportovaném flow grafu

# studio.navigation.graph_edges_caption
source: Push, sheet, replace, and pop transitions
cs: Push, sheety, replace a pop přechody

# studio.navigation.graph_root_caption
source: Primary entry route for the current bundle
cs: Primární vstupní route pro aktuální bundle

# studio.foundation.references_count
source: %lld references
cs: %lld referencí

# studio.foundation.components_count
source: %lld components
cs: %lld komponent

# studio.foundation.items_count
source: %lld items
cs: %lld položek

# studio.content.states_count
source: %lld states
cs: %lld stavů

# studio.content.links_count
source: %lld links
cs: %lld odkazů

# studio.content.default_state_value
source: Default: %@
cs: Výchozí: %@

# studio.content.state_value
source: State: %@
cs: Stav: %@

# studio.navigation.depth_value
source: Depth %lld
cs: Hloubka %lld

# studio.preview.stack.single
source: Single Screen
cs: Samostatná obrazovka

# studio.preview.stack.stacked
source: Stacked Flow
cs: Vrstvený flow

# studio.preview.stack.branched
source: Branched Flow
cs: Rozvětvený flow

# common.close
source: Close
cs: Zavřít

# common.current
source: Current
cs: Aktuální

# common.results_count
source: %lld results
cs: %lld výsledků

# common.unknown
source: Unknown
cs: Neznámé

# studio.content.component_summary
source: Component · %@
cs: Komponenta · %@

# studio.content.components_short
source: comps
cs: komp.

# studio.foundation.color_token_summary
source: Color token · %@
cs: Barevný token · %@

# studio.foundation.icon_summary
source: Icon · %@
cs: Ikona · %@

# studio.foundation.typography_summary
source: Typography · %lld pt
cs: Typografie · %lld pt

# studio.navigation.incoming_short
source: in
cs: vst.

# studio.navigation.outgoing_short
source: out
cs: výst.

# studio.navigation.flow_summary
source: Navigation flow · %lld outgoing edges
cs: Navigační flow · %lld odchozích hran

# studio.quick_open.pages
source: Pages
cs: Stránky

# studio.quick_open.search_placeholder
source: Search pages, foundations, components, and views…
cs: Hledej stránky, foundations, komponenty a views…

# studio.quick_open.no_matches
source: No matches
cs: Žádné výsledky

# studio.quick_open.no_matches_description
source: Try searching by token name, component, view, or page.
cs: Zkuste hledat podle názvu tokenu, komponenty, view nebo stránky.

# studio.review.component_no_truth_reason
source: No reference snapshot is exported and the native inspector also has no declared state catalog to lean on yet.
cs: Není exportovaný žádný referenční snapshot a nativní inspector zatím nemá ani deklarovaný state katalog, o který by se mohl opřít.

# studio.review.component_missing_snapshot_reason
source: The component has declared states, but there is still no exported reference snapshot to confirm visual truth.
cs: Komponenta má deklarované stavy, ale stále jí chybí exportovaný referenční snapshot pro potvrzení vizuální pravdy.

# studio.review.component_fully_backed_reason
source: This component is fully backed by exported truth.
cs: Tato komponenta je plně podložená exportovanou pravdou.

# studio.review.view_missing_snapshot_reason
source: The screen has flow and component metadata, but no exported reference snapshot yet, so visual truth still needs review.
cs: Screen má flow i component metadata, ale zatím nemá exportovaný referenční snapshot, takže vizuální pravda stále potřebuje review.

# studio.review.view_fully_backed_reason
source: This view is fully backed by exported truth.
cs: Tato view je plně podložená exportovanou pravdou.

# studio.snapshot.approximation_only
source: Approximation only
cs: Jen aproximace

# studio.sources.title
source: Sources
cs: Zdroje
